using System;
using System.Collections.Generic;
using System.Diagnostics.CodeAnalysis;
using System.Diagnostics.Contracts;
using System.IO;
using System.Linq;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
#if INTRINSICS
using System.Runtime.Intrinsics;
using System.Runtime.Intrinsics.X86;
#endif
using System.Threading.Tasks;

// ReSharper disable BuiltInTypeReferenceStyle

// Use nint when referring to pointer values, long when referring to 64 bit values.
using nint = System.Int64;
using nuint = System.UInt64;
// ReSharper disable SuggestVarOrType_BuiltInTypes
// ReSharper disable SuggestVarOrType_Elsewhere

namespace Portent
{
    public sealed unsafe class Dawg : IDisposable
    {
        [MethodImpl(MethodImplOptions.AggressiveOptimization)]
        public IEnumerable<SuggestItem> Lookup(in string word, uint maxEdits)
        {
            if (maxEdits == 0)
            {
                var index = GetIndex(word);
                if (index < 0)
                {
                    return Enumerable.Empty<SuggestItem>();
                }

                _singleWordResult.Update(word, _jobs[0]._graph._wordCounts[index]);
                return _singleWordResult;
            }

            _compoundResultCollection.Clear();
            var wordLength = (uint) word.Length;

#pragma warning disable S1135 // Track uses of "TODO" tags
// TODO: Align these allocated chunks together.
            // + 1 for the (char)0 at the start.

                // TODO: We have some extra registers to store stuff in, and they're getting push-popped anyways. Load things and prevent re-reading from memory.
                uint* row0 = closure._row0;
                closure._builderDepth = newDepth;
                // casting to byte* because otherwise it was doing both shl 1 and shl 2 to double _maxPlusOne and then convert it to pointer moves
                // ReSharper disable once ArrangeRedundantParentheses
                closure._row0 = (uint*) ((maxPlusOne * 8) + (byte*) row0);
                char* builderPointer = closure._builderStart + newDepth;
                char* edgeC = closure._graph._edgeCharacters;
                int* edgeN = closure._graph._edgeToNodeIndex;
                do
                {
                    // TODO: My thought is that 32 bit read/writes are faster, so just do it in 32 bit mode anyways. Check if this is true.
                    *(uint*) builderPointer = *(uint*) (edgeC + childEdge);
                    closure._node = edgeN[childEdge];
                    ++childEdge;
                    MatchCharacter(ref closure, skip);
                }
                while ((uint)childEdge < childEdgeEnd);

                --closure._builderDepth;
                closure._row0 = row0;

#pragma warning disable S1116 // Empty statements should be removed - This one serves a purpose
                singleReturn:;
#pragma warning restore S1116 // Empty statements should be removed
            }

            MatchCharacter(ref closureArg, 0);
        }

#pragma warning disable S3898 //Value types should implement "IEquatable<T>"
        private readonly ref struct Run
        {
            public readonly char* _input;
            public readonly uint* _toCache;
            public readonly uint _wordLength;
            public readonly uint _maxPlusOne;

            public Run(char* input, uint* toCache, uint wordLength, uint maxPlusOne)
            {
                _input = input;
                _toCache = toCache;
                _wordLength = wordLength;
                _maxPlusOne = maxPlusOne;
            }
        }
#pragma warning restore S3898 //Value types should implement "IEquatable<T>"

        private class Job
        {
            public Run* _run;
            public readonly nint _edge;
            public readonly DawgGraph _graph;
            public readonly SuggestItemCollection _results;

            public Job(nint edge, DawgGraph graph, SuggestItemCollection results)
            {
                _edge = edge;
                _graph = graph;
                _results = results;
            }

            public Action DoWork()
            {
                return SearchPrivate;
            }

            private void SearchPrivate()
            {
                Search5(this);
            }
        }

        [StructLayout(LayoutKind.Explicit)]
#pragma warning disable S3898 //Value types should implement "IEquatable<T>"
        private readonly struct DawgGraph
        {
            [FieldOffset(0x00)] //48
            public readonly ulong* _wordCounts;

            [FieldOffset(0x08)] //50
            public readonly ushort* _reachableTerminalNodes;

            [FieldOffset(0x10)] //58
            public readonly uint* _firstChildEdgeIndex;

            [FieldOffset(0x18)] //60
            public readonly int* _edgeToNodeIndex;

            [FieldOffset(0x20)] //68
            public readonly char* _edgeCharacters;

            [FieldOffset(0x28)] //70
            public readonly nint _rootNodeIndex;

            public DawgGraph(ushort* reachableTerminalNodes, ulong* wordCounts, uint* firstChildEdgeIndex, char* edgeCharacters, int* edgeToNodeIndex, nint rootNodeIndex)
            {
                _reachableTerminalNodes = reachableTerminalNodes;
                _wordCounts = wordCounts;
                _firstChildEdgeIndex = firstChildEdgeIndex;
                _edgeCharacters = edgeCharacters;
                _edgeToNodeIndex = edgeToNodeIndex;
                _rootNodeIndex = rootNodeIndex;
            }
        }
#pragma warning restore S3898 //Value types should implement "IEquatable<T>"

        [Pure]
        [MethodImpl(MethodImplOptions.AggressiveOptimization)]
        private static ulong GetWordCount(char* word, nuint length, in DawgGraph dawg)
        {
            ulong* number = dawg._wordCounts;
            ushort* terminals = dawg._reachableTerminalNodes;
            uint* edgeChildIndex = dawg._firstChildEdgeIndex;
            int* edgeNodeIndex = dawg._edgeToNodeIndex;
            char* characters = dawg._edgeCharacters;
            nint currentNode = dawg._rootNodeIndex;
            // Because we want 0-indexed
            number--;
            char* end = word + length;
            do
            {
                char target = *word;
                word++;
                // ReSharper disable once RedundantCast - Just being explicit and clear
#pragma warning disable IDE0004 // Remove Unnecessary Cast
                nuint i = (nuint) edgeChildIndex[currentNode];
#pragma warning restore IDE0004 // Remove Unnecessary Cast
                uint lastChildIndex = edgeChildIndex[currentNode+1];
                do
                {
                    // ReSharper disable once RedundantCast - Just being explicit and clear
#pragma warning disable IDE0004, S1905 // Remove Unnecessary Cast
                    currentNode = (nint)edgeNodeIndex[i];
#pragma warning restore IDE0004, S1905 // Remove Unnecessary Cast
                    char currentEdgeChar = characters[i];
                    i++;
                    if (currentEdgeChar != target)
                    {
                        // TODO: This might be predictable? Otherwise use Abs
                        if (currentNode < 0)
                        {
                            currentNode = -currentNode;
                        }

                        number += (long)terminals[currentNode];
                        continue;
                    }

                    if (currentNode < 0)
                    {
                        ++number;
                        currentNode = -currentNode;
                    }

                    break;
                } while ((uint)i < lastChildIndex);
            } while (word < end);

            return *number;
        }

        [StructLayout(LayoutKind.Explicit)]
#pragma warning disable S3898 //Value types should implement "IEquatable<T>"
        private ref struct Search3Closure
        {
            #region CacheLine1
            [FieldOffset(0x00)]
            public nuint _builderDepth;

            [FieldOffset(0x08)]
            public char* _first;

            [FieldOffset(0x10)]
            public uint _wordLength;

            [FieldOffset(0x14)]
            public uint _maxPlusOne;

            [FieldOffset(0x18)]
            public uint* _row0;
            #endregion CacheLine1

            #region CacheLine2
            [FieldOffset(0x20)]
            public char* _builderStart;

            [FieldOffset(0x28)]
            public uint* _transpositionRow;

            [FieldOffset(0x30)]
            public uint* _toCache;

            [FieldOffset(0x38)]
            public int _node;
            #endregion CacheLine2

            #region CacheLine3
            [FieldOffset(0x48)]
            public DawgGraph _graph;

            [FieldOffset(0x78)]
            public SuggestItemCollection _results;
            #endregion CacheLine3
        }
#pragma warning restore S3898 //Value types should implement "IEquatable<T>"

        public uint WordCount { get; }

        private readonly nint _rootFirstChild;
        private readonly nint _rootLastChild;

        private readonly Task[] _tasks;
        private readonly Job[] _jobs;
        private readonly Dictionary<char, int> _characterIndex;

        private readonly SingleElementSuggestItemCollection _singleWordResult = new SingleElementSuggestItemCollection();
        private readonly CompoundSuggestItemCollection _compoundResultCollection;

        private readonly LargePageMemoryChunk _memoryBlock;

        [MethodImpl(MethodImplOptions.AggressiveOptimization)]
        public string GetWord(int index)
        {
            if (index < 0)
            {
                throw new ArgumentException("Index was outside the bounds of the array. " +
